export const cusineTypes = {
    'европейская': '🇪🇺',
    'японская': '🇯🇵',
    'грузинская': '🇬🇪',
    'итальянская': '🇮🇹',
    'русская': '🇷🇺',
    'еврейская': '🇮🇱',
    'нет специализации': '🏳',
    'американская': '🇺🇸',
    'китайская': '🇨🇳',
    'французская': '🇫🇷',
    'вьетнамская': '🇻🇳',
    'кавказская': '🍖',
    'паназиатская': '🥡',
    'азиатская': '🥡',
    'авторская': '👨‍🍳',
    'сербская': '🇷🇸',
    'испанская': '🇪🇸',
    'турецкая': '🇹🇷',
    'восточная': '🥡',
    'корейская': '🇰🇷',
    'фьюжн': '🏁',
    'украинская': '🇺🇦',
    'морская': '🌊',
    'мясная': '🥩',
    'рыбная': '🦐',
    'домашняя': '🥞',
    'смешанная': '🏳',
    'средиземноморская': '🌯',
    'вегетерианская': '🌱',
    'шашлык': '🍖',
    'национальная': '🇷🇺',
    'международная': '🌏',
    'французская': '🇫🇷',
    'немецкая': '🇩🇪',
    'чешская': '🇨🇿',
    'узбекская': '🇺🇿',
    'азербайджанская': '🇦🇿',
    'арабская': '🇸🇦',
    'сибирская': '🥘',
    'славянских народов': '👫',
    'постная': '⛪',
    'армянская': '🇦🇲',
    'английская': '󠁧󠁢󠁥󠁮󠁧🇬🇧',
    'веганская': '🌱',
    'континентальная': '🌏',
    'татарская': '🍯',
    'индийская': '🇮🇳',
    'тайская': '🇹🇭',
    'африканская': '🌍',
    'осетинская': '🍖',
    'болгарская': '🇧🇬',
    'восточно-европейская': '🇪🇺',
    'мексиканская': '🇲🇽',
    'скандинавская': '🇩🇰🇸🇪',
    'индонезийская': '🇮🇩',
    'белорусская': '🇧🇾',
    'среднеазиатская': '🍜',
    'латиноамериканская': '🌎',
    'греческая': '🇬🇷',
    'халяльная': '🕌'
}

export const emojis = {
    'Доставка еды': '🚚',
    'Еда навынос': '🥡',
    'Оплата картой': '💳',
    'Летняя веранда': '🌅',
    'Wi-Fi': '🌐',
    'Кофе с собой': '☕',
    'Крафтовое пиво': '🍺',
    'Предзаказ онлайн': '🌐',
    'Бизнес-ланч': '🕴🏻',
    'Подарочный сертификат': '📃',
    'Завтрак': '🍳',
    'Проектор': '📽',
    'Настольные игры': '🎲',
    'Детское меню': '👶🏻',
    'Спортивные трансляции': '⚽',
    'Парковка для людей с инвалидностью': '♿',
    'Детская комната': '👶🏻',
    'Самовывоз': '🚶‍♂',
    'Доставка': '🚚',
    'Лифт': '♿',
    'Танцпол': '🕺🏾',
    'Автоматическая дверь': '♿',
    'Туалет для людей с инвалидностью': '♿',
    'Караоке': '🎤',
    'Пандус': '♿',
    'Зарядка для телефона': '📳',
    'WC': '🚾',
    'Питьевая вода': '🥛',
    'Бесплатная доставка': '🆓',
    'Оплата счета по QR-коду': '📲',
    'Чай': '☕',
    'Фудкорт': '🪔',
    'Бильярд': '🎱',
    'Скидка на еду': '💸',
    'Икорный магазин': '🟠',
    'Кнопка вызова персонала': '♿',
    'Доставка продуктов': '🚚',
    'Парковка': '🅿',
    'Шоу-программа': '💃🏼',
    'Фейс-контроль': '💂‍♂',
    'Ресторан': '🍴',
    'Место для отдыха': '🏖',
    'Предварительная запись': '📝',
    'Льготные билеты': '👵',
    'Хлеб из тандыра': '🍞',
    'Чайная': '☕',
    'Печать на тортах': '🎂',
    'барная стойка': '🍸',
    'винная карта': '🍷',
    'закрытие под банкет': '🥂',
    'кулинария': '🍽',
    'меню на английском': '🇬🇧',
    'DJ': '🎧',
    'бесплатная парковка': '🅿',
    'своя пекарня': '🥐',
    'можно с животными': '🐈',
    'живая музыка': '🎷',
    'устричный бар': '🦪',
    'бранчи': '🧇',
    'детская анимация': '👶',
    'гриль': '🥓',
    'домашняя еда': '🥗',
    'выпечка': '🥐',
    'шашлыки': '🍖',
    'круглосуточная кухня': '🏪',
    'местоположение у воды': '🌊',
    'суши и роллы': '🍣',
    'узбекская еда': '🇺🇿',
    'комплексные обеды': '🍴',
    'грузинская еда': '🇬🇪',
    'пицца': '🍕',
    'можно с ноутбуком': '💻',
    'сладости': '🍭',
    'здоровое питание': '🥗',
    'осетинские пироги': '🥧',
    'китайская еда': '🇨🇳🥡'
}


export const tagsList = {
    'Летняя веранда': '🌅',
    'Кофе с собой': '☕',
    'Крафтовое пиво': '🍺',
    'Бизнес-ланч': '🕴🏻',
    'Завтрак': '🍳',
    'Проектор': '📽',
    'Настольные игры': '🎲',
    'Спортивные трансляции': '⚽',
    'Танцпол': '🕺🏾',
    'Караоке': '🎤',
    'Бильярд': '🎱',
    'Шоу-программа': '💃🏼',
    'Место для отдыха': '🏖',
    'барная стойка': '🍸',
    'винная карта': '🍷',
    'меню на английском': '🇬🇧',
    'DJ': '🎧',
    'своя пекарня': '🥐',
    'живая музыка': '🎷',
    'бранчи': '🧇',
    'местоположение у воды': '🌊',
    'комплексные обеды': '🍴'
}


export const additional = Object.keys(emojis).reduce((acc, key) => {
    if (!tagsList.hasOwnProperty(key)) {
        acc[key] = emojis[key];
    }
    return acc;
}, {});


export const placeTypes = ['детское кафе', 'пироговая', 'фаст-фуд', 'закусочная', 'шашлычная', 'рыбный ресторан', 'винотека', 'ресторан морепродуктов', 'винный ресторан', 'гриль-бар', 'пивной ресторан', 'бар-клуб', 'гастропаб', 'таверна', 'хинкальная', 'семейный ресторан', 'ресторан в ТЦ', 'итальянский ресторан', 'ресторан с детской комнатой', 'стейк-хаус', 'чайный клуб', 'чайхана', 'халяльный ресторан', 'узбекский ресторан', 'ресторан на воде', 'ресторан премиум-класса', 'ресторан с живой музыкой', 'кавказский ресторан', 'бургерная', 'блинная', 'пончиковая', 'пельменная', 'коктейльный бар', 'виски бар', 'мясной ресторан', 'танцевальный бар', 'поке бар', 'чебуречная', 'фалафельная', 'бельгийский бар', 'раменичная', 'японский ресторан', 'грузинский ресторан', 'вегетарианский ресторан', 'веганский ресторан', 'паназиатский ресторан', 'азиатский ресторан', 'китайский ресторан', 'вьетнамский ресторан', 'тайский ресторан', 'мексиканский ресторан', 'ресторан еврейской кухни', 'ресторан авторской кухни', 'ресторан русской кухни', 'ресторан американской кухни', 'кофейня с завтраками', 'индийский ресторан', 'корейский ресторан', 'французский ресторан', 'трактир', 'ресторан с панорамным видом', 'ресторан с летней верандой', 'крафтовый бар', 'рюмочная', 'ирландский паб', 'пивной бар', 'лапшичная', 'ресторан при отеле', 'джаз-клуб', 'скандинавский ресторан', 'кошерный ресторан', 'спикизи бар', 'бистро']

export const musicTypes = ['chillout', 'электронная', 'блюз', 'джаз', 'инструментальная', 'лаунж', 'фоновая', 'pop', 'funky', 'progressive house', 'progressive', 'mash-up', 'live dj sets', 'house', 'euro dance', "drum 'n' bass", 'deep house', 'hard dance', '80-90-х', 'british house', 'deep tek house', 'disco house', 'dj`s', 'electro', 'electro-house', 'europop', 'живая', 'танцевальная', 'классическая', 'восточная', 'рок', "r'n'b", 'soul', 'латиноамериканская', 'рэп', 'этника', 'фольклорная', 'рок-н-ролл', 'rockabilly', 'кантри', 'диско', 'ретро', 'по заказу', 'авторская песня', 'панк', 'шансон', 'reggae', 'ремиксы на шлягеры', 'tech', 'trance', 'звёзды эстрады']


const bruh = {
    "address": "ул. Большая Якиманка, 22, Москва",
    "average_bill": "2300",
    "description": "Уютный ресторан с превосходным видом на Большую Якиманку",
    "description_vector": [
        0
    ],
    "features": {
        "Кухня": ["европейская", "итальянская", "паназиатская", "авторская"],
        "Тип заведения": ["винотека"],
        "Цены": ["высокие"],
        "Музыка": ['live dj sets', 'house', 'funky', 'chillout', 'soul', 'dj`s', 'лаунж', 'фоновая']
    },
    "features_vector": [
        0
    ],
    "id": 0,
    "menu": {
        "Грибной пирог с фуа-гра и трюфельным пюре": {
            "description": "Тесто слоеное, шпинат, шампиньоны, сморчки, сливки, пармезан, чеддер, узбекские томаты, белые грибы, картофельное пюре, чеснок",
            "weight": "265 г",
            "price": "990 ₽",
            "image": "https://avatars.mds.yandex.net/get-eda/3682162/620a717637154ac395b0f1054e08c7c3/orig"
        },
        "Дальневосточный гребешок с картофельным пюре и черным трюфелем": {
            "description": "Гребешок, картофельное пюре (картофель, масло сливочное, сливки, соль), тимьян, масло сливочное, чеснок, куриный бульон, лук-сибулет, масло трюфельное, лисички, горошек зеленый",
            "weight": "238 г",
            "price": "1390 ₽",
            "image": "https://avatars.mds.yandex.net/get-eda/3725642/aa4e51753bd24152bdc1693c15b212d2/orig"
        },
        "Осьминог с печеным картофелем и соусом чимичурри": {
            "description": "Осьминог, картофель мини, помидоры черри, лук-шалот, оливки, масло сливочное, каперсы, бульон куриный, масло оливковое, базилик, перец чили, соль, соус чимичурри (масло оливковое, кинза, чеснок, перец чили, соль)",
            "weight": "230 г",
            "price": "1430 ₽",
            "image": "https://avatars.mds.yandex.net/get-eda/3435765/bb2266f0f2b24d80b7ef0fbe98b157bc/orig"
        }
    },
    "name": "Mushrooms",
    "phone_number": "+7 (495) 725-25-78",
    "photos": {
        "cover": [
            "https://cdn-ynd-nav-dev.technolab.com.ru/file/5ef4ba75bddd18001999b5a9",
            "https://avatars.mds.yandex.net/get-altay/1779701/2a0000016a9262315a0fbc5344a754341255/XXXL",
            "https://avatars.mds.yandex.net/get-altay/1909414/2a0000016a926291e233b47c25a410bea843/XXXL",
            "https://avatars.mds.yandex.net/get-altay/372953/2a0000015df63b12fa3fa70cd10d01a08d09/XXXL",
            "https://avatars.mds.yandex.net/get-altay/5100737/2a000001806c5d782769d155379d96c868aa/XXXL"
            ],
        
        "food": [
            "https://avatars.mds.yandex.net/get-altay/176734/2a00000166102a468fe3e87c21e0248c7c88/XXXL",
            "https://avatars.mds.yandex.net/get-altay/1360498/2a00000166107afcff62f3e505401b6fde98/XXXL",
            "https://avatars.mds.yandex.net/get-altay/1360498/2a00000166107b418d1bf5c2e84ff6d328d2/XXXL"
        ],
    
        "inside":[
            "https://avatars.mds.yandex.net/get-altay/225456/2a0000016009d05872e37473327c1881d3c8/XXXL",
            "https://avatars.mds.yandex.net/get-altay/1779701/2a0000016a9262315a0fbc5344a754341255/XXXL",
            "https://avatars.mds.yandex.net/get-altay/1879929/2a0000016a92630279057b5fc49acf1dce0b/XXXL"
            ],
    
        "outside": [
            "https://avatars.mds.yandex.net/get-altay/8074519/2a000001885bff92e999a1080f2ea87b1e32/XXXL",
            "https://avatars.mds.yandex.net/get-altay/5100737/2a000001806c5d782769d155379d96c868aa/XXXL",
            "https://avatars.mds.yandex.net/get-altay/10589039/2a0000018a74b75a731c89d8607156d3ca9c/XXXL"
        ]
        
    },
    "tags": ['Доставка еды', 'Еда навынос', 'Оплата картой', 'Wi-Fi', 'Кофе с собой', 'Предзаказ онлайн', 'Летняя веранда', 'меню на английском', 'DJ', 'бесплатная парковка', 'барная стойка', 'винная карта', 'есть банкетный зал'],
    "tags_vector": [
        0
    ],
    "work_hours": 
    {"Среда": "10:00 – 00:00",
    "Вторник": "10:00 – 00:00",
    "Пятница": "10:00 – 00:00",
    "Суббота": "10:00 – 00:00",
    "Четверг": "10:00 – 00:00",
    "Понедельник": "10:00 – 00:00",
    "Воскресенье": "10:00 – 00:00"
}
}